In [1]:
import sqlite3
import pandas as pd

In [ ]:
data = {
    'title': ['Inception', 'Interstellar', 'The Matrix'],
    'year': [2010, 2014, 1999],
    'score': [8.8, 8.6, 8.7]
}

df = pd.DataFrame(data)

In [4]:
# Create or connect to a SQLite database
conn = sqlite3.connect('movies.db')

# Save the DataFrame to a table named 'movies'
df.to_sql('movies', conn, if_exists='replace', index=False)

# Save the DataFrame to a table named 'movies'
df.to_sql('movies2', conn, if_exists='replace', index=False)

# Optional: Close the connection
conn.close()

In [2]:
# Reconnect and read the table back into a DataFrame
conn = sqlite3.connect('movies.db')
df_loaded = pd.read_sql('SELECT * FROM movies', conn)
print(df_loaded)
conn.close()

          title  year  score
0     Inception  2010    8.8
1  Interstellar  2014    8.6
2    The Matrix  1999    8.7

In [2]:
# Connect to your database
conn = sqlite3.connect("data/drone_data.db")
cursor = conn.cursor()

# Get all table names
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()

# Read all tables into a dictionary of DataFrames 
db_tables = {}
for table_name in tables:
    name = table_name[0]
    df = pd.read_sql_query(f"SELECT * FROM {name}", conn)
    db_tables[name] = df

# Example: print all table names and their contents
for name, df in db_tables.items():
    print(f"\nTable: {name}")
    print(df)

DatabaseError: Execution failed on sql 'SELECT * FROM 29bd2f23_889d_4604_9f18_17c506fffc80': unrecognized token: "29bd2f23_889d_4604_9f18_17c506fffc80"

In [3]:
import sqlite3
import pandas as pd

# Connect to your SQLite database
conn = sqlite3.connect("data/drone_data.db")
cursor = conn.cursor()

# 1. List all tables in the database
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
print("Tables in the database:")
for t in tables:
    print("-", t[0])  # t is a tuple like ('table_name',)

# 2. Read contents of each table
for t in tables:
    table_name = t[0]
    print(f"\n--- Contents of table: {table_name} ---")
    df = pd.read_sql_query(f"SELECT * FROM '{table_name}'", conn)
    display(df.head())  # Show only the first few rows

Tables in the database:
- 2106e02c_4c66_4aa4_b486_0ecb2c30f091
- b1902761_7c2c_4625_82ab_74179ea3e1c8

--- Contents of table: 2106e02c_4c66_4aa4_b486_0ecb2c30f091 ---

  Seconds Height    Speed
0       1   5 ft  0.5 m/s
1       2   5 ft  0.6 m/s
2       3   6 ft  0.7 m/s
3       4   6 ft  0.8 m/s
4       5   6 ft  0.9 m/s

--- Contents of table: b1902761_7c2c_4625_82ab_74179ea3e1c8 ---

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   22
3    Diana   28
4    Ethan   35